title: HiveNightmare Exploitation - Accessing SAM/System Hives
id: 8a7a6d1c-7e3b-4ef0-8c13-07ac7b9dd333
status: stable
description: Detects attempts to access or copy Windows registry hives abused in CVE-2021-36934
logsource:
  category: file_access
  product: windows
detection:
  selection:
    TargetFilename|endswith:
      - '\Windows\System32\config\SAM'
      - '\Windows\System32\config\SYSTEM'
      - '\Windows\System32\config\SECURITY'
  condition: selection
fields:
  - TargetFilename
  - Image
  - User
  - Hostname
level: critical
tags:
  - attack.credential_access
  - cve.2021.36934
  - hivenightmare
