title: PrintNightmare Exploitation via Spooler Service
id: b9d8cc43-4867-4c94-aac2-89f17709a7a5
status: stable
description: Detects suspicious activity related to PrintNightmare (CVE-2021-34527) exploitation.
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\rundll32.exe'
    CommandLine|contains:
      - 'spoolsv'
      - 'PrintNotify'
      - 'RpcAddPrinterDriverEx'
  condition: selection
fields:
  - Image
  - CommandLine
  - ParentImage
  - User
  - Hostname
level: high
tags:
  - attack.execution
  - cve.2021.34527
  - printnightmare
