title: Rundll32 With Suspicious Parameters
id: a8364cfc-7771-49f4-9614-fb14c678f0b6
description: Detects use of rundll32.exe to execute scripts or uncommon functionality
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: "\rundll32.exe"
    CommandLine|contains:
      - "javascript"
      - "url.dll"
      - "LaunchApplication"
  condition: selection
level: medium
tags:
  - attack.defense_evasion
  - attack.t1218.011
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
