title: Certutil Used to Download Remote File
id: 6f63d67f-14c5-41fa-934b-93970c5a6c3b
description: Detects certutil.exe used to download a file via HTTP
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: "\certutil.exe"
    CommandLine|contains:
      - "http"
      - "-urlcache"
      - "-split"
  condition: selection
level: high
tags:
  - attack.command_and_control
  - attack.t1105
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Certutil/
