title: Suspicious WMIC Execution
id: d13f2944-3b3b-4d66-8e2d-60447eaa4a9f
description: Detects WMIC being used with suspicious execution keywords
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: "\wmic.exe"
    CommandLine|contains:
      - "process call create"
      - "cmd.exe"
      - "powershell.exe"
  condition: selection
level: medium
tags:
  - attack.execution
  - attack.t1047
references:
  - https://lolbas-project.github.io/lolbas/Binaries/Wmic/
