title: PowerShell Encoded Command Execution
logsource:
  product: windows
  service: sysmon
detection:
  selection:
    Image|endswith: 'powershell.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - 'IEX'
  condition: selection
level: high
