title: Rundll32 with Suspicious Parameters
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: "rundll32.exe"
    CommandLine|contains:
      - "javascript"
      - "url.dll"
      - "LaunchApplication"
  condition: selection
level: medium
description: Detects misuse of rundll32.exe for executing malicious code.
