title: Office Application Spawning Command Shell
logsource:
  category: process_creation
  product: windows
detection:
  selection_parent:
    ParentImage|contains:
      - "excel.exe"
      - "winword.exe"
      - "outlook.exe"
  selection_child:
    Image|endswith:
      - "cmd.exe"
      - "powershell.exe"
      - "wscript.exe"
  condition: selection_parent and selection_child
level: high
description: Detects Office applications spawning a shell which is common in phishing attacks.
