title: Encoded PowerShell Command
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - "powershell"
      - "-enc"
      - "frombase64string"
  condition: selection
level: high